clients_info = [
    ('Иванова Анна Сергеевна', 'Заверение подписи', 2200, 70),
    ('Соколова Вера Николаевна', 'Составление нотариального завещания', 1800, 80),
    ('Федоров Евдокий Даниилович', 'Оформление доверенности', 1900, 100),
    ('Васильев Игорь Валентинович', 'Оформление брачного контракта', 5000, 100),
    ('Смирнов Сергей Игоревич', 'Подтверждение права собственности', 1800, 100),
    ('Михайлов Павел Викторович', 'Оформление сделок кредитования', 3700, 50),
    ('Козлов Владислав Павлович', 'Оформление сделок дарения', 2900, 180),
    ('Кузнецова Мария Владимировна', 'Оформление сделок дарения', 2900, 180),
    ('Новикова Евгения Алексеевна', 'Оформление сделок кредитования', 3700, 50)
]
