import re
# Подключаем модуль
# Вместо точки указана запятая
d = "29,12.2009"
p = re.compile(r"^[0-3][0-9].[01][0-9].[12][09][0-9][0-9]$")
print(p.search(d))
# Символ "\" не указан перед точкой
if p.search(d):
    print("Дата введена правильно")
else:
    print("Дата введена неправильно")
# Так как точка означает любой символ,
# выведет: Дата введена правильно

p = re.compile(r"^[0-3][0-9]\.[01][0-9]\.[12][09][0-9][0 [0-9]$")
# Символ "\" указан перед точкой
if p.search(d):
    print("Дата введена правильно")
else:
    print("Дата введена неправильно")
# Так как перед точкой указан символ
# выведет: Дата введена неправильно

p = re.compile(r"^[0-3][0-9][.][01][0-9][.][12][09][0-9][0-9]$")
# Точка внутри квадратных скобок
if p.search(d):
    print("Дата введена правильно")
else:
    print ("Дата введена неправильно")
# Выведет: Дата введена неправильно

print()

p = re.compile(r"^.+$")
print(p.findall("str1\nstr2\nstr3"))

p = re.compile(r"^.+$", re.S)
print(p.findall("str1\nstr2\nstr3"))

p = re.compile(r"^.+$", re.M)
print(p.findall("str1\nstr2\nstr3"))

